In [1]:
#concatenating (연결)
#merging(병합)

In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({"key": list("bbacaab"),
                    "data1": range(7)})
df2 = pd.DataFrame({"key": list("abd"),
                    "data2": range(3)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [10]:
pd.merge(df1, df2, on="key")
#병합 (둘다 가지고 있는 값만 연결시킨다)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
pd.merge(df1, df2, on="key", how="outer")
#모든 데이터를 연결시킨다

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [11]:
pd.merge(df1, df2, on="key", how="left")
#왼쪽 인자 df1을 기준으로 df2 행을 붙인다

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [17]:
df3 = pd.DataFrame({"lkey": list("bbacaab"),
                    "data1": range(7)})
df4 = pd.DataFrame({"rkey": list("abd"),
                    "data2": range(3)})
#기준열이 같지 않아도 정렬이 가능하다

In [18]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [19]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [22]:
pd.merge(df3, df4, left_on="lkey", right_on="rkey")
#참조할 기준 이름들을 명시한다

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [23]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [24]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [25]:
right1

   group_val
a        3.5
b        7.0

In [28]:
pd.merge(left1, right1, left_on="key", right_index=True)
#앞 데이터는 명시한 이름으로 명시, 뒤 데이터는 인덱스로 데이터 처리

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [29]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                     index=['a', 'c', 'e'], columns=['Seoul', 'Incheon'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'], columns=['Daegu', 'Ulsan'])

In [30]:
left2

   Seoul  Incheon
a    1.0      2.0
c    3.0      4.0
e    5.0      6.0

In [31]:
right2

   Daegu  Ulsan
b    7.0    8.0
c    9.0   10.0
d   11.0   12.0
e   13.0   14.0

In [32]:
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)
#두 데이터 모두 인덱스로 병합한다

   Seoul  Incheon  Daegu  Ulsan
a    1.0      2.0    NaN    NaN
b    NaN      NaN    7.0    8.0
c    3.0      4.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    5.0      6.0   13.0   14.0

In [33]:
s1 = pd.Series([0, 1], index=["a", "b"])
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"])
s3 = pd.Series([5, 6], index=["f", "g"])

In [34]:
s1

a    0
b    1
dtype: int64

In [35]:
s2

c    2
d    3
e    4
dtype: int64

In [36]:
s3

f    5
g    6
dtype: int64

In [38]:
pd.concat([s1,s2,s3])
#단순히 데이터 연결 시킴

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [44]:
pd.concat([s1,s2,s3], axis=1)
#행열로 표현

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [40]:
s4 = pd.concat([s1*5,s3])

In [41]:
pd.concat([s1,s4],axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [43]:
pd.concat([s1, s2, s3], axis=1, keys=["one", "two", "three"])
#컴럼을 keys로 추가할 수 있다

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [45]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), 
                   index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), 
                   index=['a', 'c'], columns=['three', 'four'])

In [46]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [47]:
df2

   three  four
a      5     6
c      7     8

In [48]:
pd.concat([df1, df2], axis=1)
#열방향으로 데이터 연결

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [49]:
df3 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df4 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [50]:
df3

          a         b         c         d
0 -0.848607 -0.458823 -1.449441 -0.353253
1  0.195561  0.463143  1.497960 -1.142472
2  0.379718 -0.355167  2.625177 -1.533031

In [51]:
df4

          b         d         a
0  1.568589 -0.035195 -0.539053
1 -0.441624  0.494773  1.323539

In [54]:
pd.concat([df3, df4])
#행방향으로 붙음 (그냥 바로 데이터 붙어 버림)

          a         b         c         d
0 -0.848607 -0.458823 -1.449441 -0.353253
1  0.195561  0.463143  1.497960 -1.142472
2  0.379718 -0.355167  2.625177 -1.533031
0 -0.539053  1.568589       NaN -0.035195
1  1.323539 -0.441624       NaN  0.494773

In [56]:
pd.concat([df3, df4], ignore_index=True)
#행 방향으로 0부터 새로 인덱스를 부여하는 코드

          a         b         c         d
0 -0.848607 -0.458823 -1.449441 -0.353253
1  0.195561  0.463143  1.497960 -1.142472
2  0.379718 -0.355167  2.625177 -1.533031
3 -0.539053  1.568589       NaN -0.035195
4  1.323539 -0.441624       NaN  0.494773